""" 4. Розробити програму, що переводить значення температури в градусах по Цельсію
    в температуру по Фаренгейту та навпаки. 
    Співвідношення між температурами визначається формулою: TF = TC *1.8 +32. 
    Діалог с користувачем реалізувати через систему меню."""

try:
    exit = False
    while not exit:
        choice = int(input("Що ви хочете конвертувати?: \n1: Цельсії в Фаренгейти \n2: Фаренгейти в Цельсії \n3: Вихід \nВаш вибір:   "))
        if choice == 1:
            Cels = float(input("Скільки градусів Цельсію:"))
            Fahr = round(Cels * 1.8, 2)
            print(f"{Cels} градусів Цельсію = {Fahr} градусів Фаренгейта\n")
        elif choice == 2:
            Fahr = float(input("Скільки градусів Цельсію:"))
            Cels = round((Fahr - 32)/ 1.8, 2)
            print(f"{Fahr} градусів Цельсію = {Cels} градусів Фаренгейта \n")
        elif choice == 3:
            print("Goob bye!")
            exit = True
        else:
            print("Оберіть пункт зі списку")
except ValueError:
    print("Error! Enter number!")